xulung_app/app/controllers/desktop_controller.rb

	def index
		if params[:tag]
			@videos = Video.order('created_at ASC').published.by_tag(params[:tag]).page(params[:page])
			@tag=params[:tag]
			@tag_counts=@videos.count
		else
			@videos = Video.order('created_at ASC').published.page params[:page]
		end
		@user_favideos=current_user.favorite_videos
		@consultant=current_user.consultant
		@total_videos=Video.count
		@total_votes=Vote.count
		if @total_videos!=0
			@average_vote=@total_votes/@total_videos
		else
			@average_vote=0
		end
		@posts=Post.all.published
		@drafts=Post.all.draft
		@useruploadedvideos=Video.where("user_id=?",current_user.id)

		@tags=Tag.all.collect(&:name)
		@videos_name=@videos.collect(&:filename)
		@title=t('meta.title')
		@description=@videos_name
		@keywords=@tags

		@published_user_posts=Post.where(user_id: current_user.id).published.approved
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."published" = 't'  ORDER BY created_at ASC LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "videos"
SELECT COUNT(*) FROM "votes"
SELECT  "consultants".* FROM "consultants"  WHERE "consultants"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "videos".* FROM "videos"  WHERE (user_id=1)
SELECT "tags".* FROM "tags"
SELECT "posts".* FROM "posts"  WHERE "posts"."user_id" = 1 AND "posts"."published" = 't' AND "posts"."approved" = 't'

	def tech
		@videos = Video.order('created_at ASC').published

		@tags=Tag.all.collect(&:name)
---
SELECT "videos".* FROM "videos"  WHERE "videos"."published" = 't'  ORDER BY created_at ASC
SELECT "tags".* FROM "tags"

	def sharetech
		@posts=Post.where(user_id: current_user.id).published
---
SELECT "posts".* FROM "posts"  WHERE "posts"."user_id" = 1 AND "posts"."published" = 't'