xulung_app/app/controllers/videos_controller.rb

  def index
    if params[:tag] or params[:query]
      @videos = Video.order('created_at ASC').published.approved.tagged_with(params[:tag]).page(params[:page])
      @tag=params[:tag]
      @tag_counts=@videos.count
    else
      @videos = Video.order('created_at DESC').published.approved.page(params[:page])
    end
    @all_videos = Video.order('created_at DESC').published.approved
    @total_videos=Video.count
    @total_votes=Vote.count
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."published" = 't' AND "videos"."approved" = 't'  ORDER BY created_at DESC LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "videos"
SELECT COUNT(*) FROM "votes"