xulung_app/app/controllers/welcome_controller.rb

	def home
		# @howtovideo=Video.find(79)
		@videos = Video.order('created_at DESC').published
		# @recommended_videos=User.find(1).favorite_videos
		@tags=Tag.all.collect(&:name)
---
SELECT "videos".* FROM "videos"  WHERE "videos"."published" = 't'  ORDER BY created_at DESC
SELECT "tags".* FROM "tags"